<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Ejercicio 3.2</title>
</head>
<body>
    <a href="/index.html">Regresar</a>
    <br>
    <a href="/HTML5/Capitulo 2/Ejercicios/Ejercicio 3-3.html">Siguiente</a>
    <hr>

    <h1>3.2 Indique si cada uno de los siguiente enunciados
        es <font style="color: green;">verdadero</font> o <font style="color: red;">false</font>. Si es <font style="color: red;">falso</font>, explique por qu&eacute;.
    </h1>

    <ol type="a">
        <!--a)-->
        <li style="font-size: 20px;font-weight: bold;">
            Cualquier tipo <em>input</em> particular de formulario de HTML5 debe desplegarse de manera id&eacute;ntica en todos los navegadores compatibles con HTML5.
        </li>
        <p style="font-size: 18px;">
            <font style="color: red;">Falso</font>, la forma que se despliegan los tipos <em>input</em> pueden variar de un navegador a otro.
        </p>
        <!--b)-->
        <li style="font-size: 20px;font-weight: bold;">
            Cuando se coloca el enfoque en el campo de texto (es decir, si el cursor est&aacute; en el campo de texto), se env&iacute;a el texto del atributo <em>placeholder</em> al servidor.
        </li>
        <p style="font-size: 18px;">
            <font style="color: red;">Falso</font>, cuando se selecciona el campo de texto, el texto de <em>placeholder</em> desaperece y se env&iacute;a el texto que escriba el usuario.
        </p>
        <!--c)-->
        <li style="font-size: 20px;font-weight: bold;">
            No es necesario incluir el atributo <em>autofocus</em> en sus formularios.
        </li>
        <p style="font-size: 18px;">
            <font style="color: green;">Verdadero</font>.
        </p>
        <!--d)-->
        <li style="font-size: 20px;font-weight: bold;">
            Los nuevos tipos <em>input</em> de HTML5 tienen validaci&oacute;n autom&aacute;tica del lado del cliente, con lo cual se elimina la necesidad de agregar secuencias de comandos (<em>script</em>)
            complicadas a sus formularios para validar la entrada del usuario y se reduce la cantidad de datos inv&aacute;lidos que se env&iacute;n.
        </li>
        <p style="font-size: 18px;">
            <font style="color: green;">Verdadero</font>.
        </p>
        <!--e)-->
        <li style="font-size: 20px;font-weight: bold;">
            El tipo <em>input range</em> se valida autom&aacute;ticamente de manera intr&iacute;nseca cuando el navegador lo despliega como un control deslizante, ya que el usuario no puede mover el control fuera de los l&iacute;mites del valor m&iacute;nimo o m&aacute;ximo.
        </li>
        <p style="font-size: 18px;">
            <font style="color: green;">Verdadero</font>.
        </p>
        <!--f)-->
        <li style="font-size: 20px;font-weight: bold;">
            HTML5 cuenta con validaci&oacute;n autom&aacute;tica para el tipo <em>input tel</em>.
        </li>
        <p style="font-size: 18px;">
            <font style="color: red;">Falso</font>, los datos que se validan var&iacute;n seg&uacute;n la ubicaci&oacute;n, por lo que ser&iacute;a bastante complejo realizar una validaci&oacute;n autom&aacute;tica.
        </p>
        <!--g)-->
        <li style="font-size: 20px;font-weight: bold;">
            Si el usuario introduce un URL con un formato inapropiado en un tipo <em>input url</em>, no se validar&aacute;. HTML5 no valida si el URL introducido existe en realidad.
        </li>
        <p style="font-size: 18px;">
            <font style="color: green;">Verdadero</font>.
        </p>
        <!--h)-->
        <li style="font-size: 20px;font-weight: bold;">
            El elemento <em>nav</em> muestra un men&uacute; desplegable de hiperv&iacute;nculos.
        </li>
        <p style="font-size: 18px;">
            <font style="color: red;">Falso</font>, solo agrupa v&iacute;nculos de navegaci&oacute;n.
        </p>
        <!--i)-->
        <li style="font-size: 20px;font-weight: bold;">
            El elemento <em>header</em> puede usarse s&oacute;lo una vez en una p&aacute;gina.
        </li>
        <p style="font-size: 18px;">
            <font style="color: red;">Falso</font>, se puede usar varias veces.
        </p>
        <!--j)-->
        <li style="font-size: 20px;font-weight: bold;">
            Los elementos <em>nav</em> pueden anidarse en un elemento <em>aside</em>.
        </li>
        <p style="font-size: 18px;">
            <font style="color: green;">Verdadero</font>.
        </p>
        <!--k)-->
        <li style="font-size: 20px;font-weight: bold;">
            Podemos usar el elemento <em>brk</em> para evitar dividir palabras en lugares incorrecto.
        </li>
        <p style="font-size: 18px;">
            <font style="color: red;">Falso</font>, se utiliza el elemento <em>wbr</em>.
        </p>
    </ol>
</body>
</html>