<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Ejercicio 5.12</title>

    <link rel="stylesheet" href="/CSS3/css/baseStyle.css" type="text/css">

    <style type="text/css">
        p { margin: 0.9em 0em; }
        .multicolumna {
            /* establecer el número de columnas en 3 */
            -webkit-column-count: 2;
            -moz-column-count: 2;
            -o-column-count: 2;
            column-count: 2;
            /* establecer el espacio entre columnas en 30px */
            -webkit-column-gap: 30px;
            -moz-column-gap: 30px;
            -o-column-gap: 30px;
            column-gap: 30px;
            /* agregar una línea negra de 1px entre cada columna */
            -webkit-column-rule: 3px outset darkgreen;
            -moz-column-rule: 3px outset darkgreen;
            -o-column-rule: 3px outset darkgreen;
            column-rule: 3px outset darkgreen;
        }

        img {
            width: 100px;
            height: 100px;
            float: left;
            padding: 10px;
        }

    </style>

</head>
<body>
    <header class="headerP">
        Ejercicio 5.12<br>
        <p class="nombre">
            Alba Garc&iacute;a Jos&eacute; Iv&aacute;n
        </p>
	<a href="/CSS3/Capitulo 5/Ejercicios/Ejercicio 5-11.html"><button type="submit">Atras</button></a>
        <a href="/index.html"><button type="submit">Principal</button></a>
        <a href="/CSS3/Capitulo 5/Ejercicios/Ejercicio 5-13.html"><button type="submit">Siguiente</button></a>
    </header>

    <div class="contenido">
        <h3>
            <em>(Texto multicolumna)</em> Cambie el formato del ejemplo en la figura 5.17 a dos columnas, agregue un subt&iacute;tulo y un nombre de autor, e incremente el color y el grosor de la regla <em>column-rule</em>. Agregue una imagen y haga que el texto flote alrededor de la imagen.
        </h3>

        <header>
            <center><h1>Computadoras, hardware y software</h1></center>
            <h3>Subt&iacute;tulo: Sistemas Computacionales</h3>
            <h4>Autor: Pearson Education</h4>
        </header>
        <div class="multicolumna">
            <p>
                Una computadora es un dispositivo que puede realizar c&aacute;lculos y tomar decisiones l&oacute;gicas con mucha m&aacute;s rapidez que los humanos. Muchas de las computadoras personales de la actualidad pueden realizar miles de millones de c&aacute;lculos en segundo&mdash;m&aacute;s de lo que un humano puede realizar durante toda su vida. Las supercomputadoras ya se encuentran realizando miles de billones (trillones) de instrucciones por segundo. Para poner esto en perspectiva, una computadora de un trill&oacute;n de instrucciones por segundo puede realizar en un segundo m&aacute;s de 100,000 c&aacute;lculos para cada persona en el planeta. Y&mdash;estos "l&iacute;mites superiores" aumentan con rapidez.
            </p>
            <p>
                Las computadoras procesan datos bajo el control de conjuntos de instrucciones llamadas programas de computadora. Estos programas gu&iacute;an a la computadora por conjuntos ordenados de acciones especificadas por personas llamadas programadores de computadora. Los programas que se ejecutan en una computadora se conocen como software. En este libro usted aprender&aacute; sobre la metodolog&iacute;a de programaci&oacute;n clave de la actualidad que mejora la productividad del programador, con lo cual se reducen los costos de desarrollo de software&mdash;programaci&oacute;n orientada a objetos.
            </p>
            <p>
                Una computadora consiste de diversos dispositivos conocidos como hardware (por ejemplo: el teclado, pantalla, rat&oacute;n, discos duros, memoria, DVD y unidades de procesamiento). Los costos de las computadoras disminuyen en forma dram&aacute;tica debido a los r&aacute;pidos desarrollos en las tecnolog&iacute;as de hardware y software. Las computadoras que podr&iacute;an haber llenado salones extensos y costar millones de d&oacute;lares hace unas d&eacute;cadas ahora se inscriben en chips de silicio m&aacute;s chicos que una u&ntilde;a, que cuestan tal vez unos cuantos d&oacute;lares. <img src="/CSS3/Capitulo 5/Imagenes/discoduro.png" alt="Disco duro"> Por iron&iacute;a el silicio es uno de los materiales m&aacute;s abundantes&mdash;es un ingrediente en la arena ordinaria. La tecnolog&iacute;a de chips de silicio ha hecho la computaci&oacute;n tan econ&oacute;mica que hay m&aacute;s de millones de computadoras de prop&oacute;sito general en uso en todo el mundo, y se espera que esta cifra se duplique en los pr&oacute;ximos a&ntilde;os.
                
            </p>
            <p>
                Los chips de computadora (microprocesadores) controlan innumerables dispositivos. Estos sistemas incrustados incluyen frenos antibloqueo en los autos, sistemas de navegaci&oacute;n, electrodom&eacute;sticos inteligentes, sistemas de seguridad en el hogar, tel&eacute;fonos celulares y Smartphones, robots, intersecciones de tr&aacute;fico inteligentes, sistemas para evitar colisiones, controladores de videojuegos y m&aacute;s. La inmensa mayor&iacute;a de los microprocesadores que se producen cada a&ntilde;o se incrustan en dispositivos que no son computadoras de prop&oacute;sito general.
            </p>
            <footer>
                <em>&copy; 2012 por Pearson Education, Inc. Todos los derechos reservados.</em>
            </footer>
        </div><br><br><br>
    </div>
</body>
</html>